Autodesk.Revit.DB.ViewPlanType
An enumerated type listing plan view types.

Autodesk.Revit.DB.ViewPlanType.CeilingPlan
Reflected ceiling plan view.

Autodesk.Revit.DB.ViewPlanType.FloorPlan
Floor plan view.